Public Attributes | List of all members
API_EdgeLoadCustomData Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Edge Load Geometry. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
GS::Array< API_AnalyticalCurve >  | curve
Position of the Analytical Edge Load.
Detailed Description
Describes a Structural Analytical Model Analytical Edge Load Geometry.
Since
Archicad 25
Member Data Documentation
◆ curve
 API_EdgeLoadCustomData::curve
Position of the Analytical Edge Load.